{
  "version": "https://jsonfeed.org/version/1",
  "user_comment": "This feed allows you to read the posts from this site in any feed reader that supports the JSON Feed format. To add this feed to your reader, copy the following URL — https://inessential.com/feed.json — and add it your reader.",
  "title": "inessential",
  "description": "Brent Simmons’s weblog.",
  "home_page_url": "https://inessential.com/",
  "feed_url": "https://inessential.com/feed.json",
  "author": {
    "name": "Brent Simmons",
    "url": "https://inessential.com/",
    "avatar": "https://ranchero.com/downloads/brent_avatar.png"
  },
  "items": [
    {
      "title": "NetNewsWire 6.2: RSS Plus Markdown",
      "date_published": "2025-11-05T13:24:30-08:00",
      "id": "https://inessential.com/2025/11/05/rss-plus-markdown.html",
      "url": "https://inessential.com/2025/11/05/rss-plus-markdown.html",
      "content_html": "<p>\n<p>On the NetNewsWire blog I’ve just announced NetNewsWire 6.2 for Mac and iOS.</p>\n\n<p>This release is almost entirely bug fixes — but it does add a couple small features and one potentially interesting one: it now supports Markdown in RSS (via the <code>source:markdown</code> element). <a href=\"https://netnewswire.blog/2025/11/05/netnewswire-for-mac-and-ios.html\">Read all about it</a> on the NetNewsWire blog.</p>\n\n<p>(And now we’re working on NetNewsWire 7, which <a href=\"https://netnewswire.blog/2025/10/07/the-liquid-glass-plan.html\">will adopt the new Liquid Glass UI</a>.)</p>\n"
    },
    {
      "title": "Why NetNewsWire Is Not a Web App",
      "date_published": "2025-10-04T12:10:26-07:00",
      "id": "https://inessential.com/2025/10/04/why-netnewswire-is-not-web-app.html",
      "url": "https://inessential.com/2025/10/04/why-netnewswire-is-not-web-app.html",
      "content_html": "<p>\n<p><a href=\"https://indieweb.social/@timbray@cosocial.ca/115311601617081367\">Tim Bray writes</a>, on Mastodon, I think correctly:</p>\n\n<blockquote>\n  <p>The canceling of ICEBlock is more evidence, were any needed, that the Web is the platform of the future, the only platform without a controlling vendor.  Anything controversial should be available through a pure browser interface.</p>\n</blockquote>\n\n<p>This is not the first time I’ve had reason to think about this — I think about issues of tech freedom every day, and I still bristle, after all these years (now more than ever), at having to publish NetNewsWire for iOS through the App Store. (The Mac version has no such requirement — it’s available via the <a href=\"https://netnewswire.com/\">website</a>, and I have no plans to ever offer it via the Mac App Store.)</p>\n\n<p>But what if I wanted to do a web app, in addition to or instead of a native app?</p>\n\n<p>I can picture a future, as I bet you can, where RSS readers aren’t allowed on any app store, and we’re essentially required to use billionaire-owned social media and platform-owned news apps.</p>\n\n<p>But there are issues with making NetNewsWire a web app.</p>\n\n<h3 id=\"money\">Money</h3>\n\n<p>I <a href=\"https://inessential.com/2023/02/20/on_not_taking_money_for_netnewswire.html\">explain in this post</a> that NetNewsWire has almost no expenses at all. The biggest expense is my Apple developer membership, and I pay just a little bit to host some websites. It adds up to a couple hundred bucks a year.</p>\n\n<p>If it were a web app instead, I could drop the developer membership, but I’d have to pay way more money for web and database hosting. Probably need a CDN too, and who knows what else. (I don’t have recent web app experience, so I don’t even know what my requirements would be, but I’m sure they’d cost substantially more than a couple hundred bucks a year.)</p>\n\n<p>I could charge for NetNewsWire, but that would go against my political goal of making sure there’s a good and <em>free</em> RSS reader available to everyone.</p>\n\n<p>I could take donations instead, but that’s never going to add up to enough to cover the costs.</p>\n\n<p>And in either case I’d have to create a way to take money and start up some kind of entity and then do bookkeeping and report money things to the right places — all stuff I don’t have to waste time on right now. I can just work on the app.</p>\n\n<p>Alternately I could create a web app that people would self-host — but there’s no way I could handle the constant support requests for installation issues. There are free self-hosted RSS readers already anyway, and NetNewsWire would be just another one. This also wouldn’t further my goal of making a free RSS reader available to everyone, since only people with the skills and willingness to self-host would do it.</p>\n\n<h3 id=\"protecting-users\">Protecting Users</h3>\n\n<p>Second issue. Right now, if law enforcement comes to me and demands I turn over a given user’s subscriptions list, I can’t. Literally can’t. I don’t have an encrypted version, even — I have nothing at all. The list lives on their machine (iOS or macOS). If they use a syncing system, it lives there too — but I don’t run a syncing system. I don’t have that info and can’t get it.</p>\n\n<p>If that happened, I’d have to pay a lawyer to see if the demand is legit and possibly help me fight it. That’s yet more money and time.</p>\n\n<p>(Could I encrypt the subscription lists on the server? Yes, but the server would have to be able to decrypt it, or else the app couldn’t possibly work. Which means I could decrypt the lists and turn them over.)</p>\n\n<h3 id=\"another-type-of-freedom\">Another type of freedom</h3>\n\n<p>Not an issue, exactly, but a thing.</p>\n\n<p>I was 12 years old when I got my first computer, an Apple II Plus, and I’ve never stopped loving the freedom of having my own computer and being able to run whatever the hell I want to.</p>\n\n<p>My computer is <em>not</em> a terminal. It’s a world I get to control, and I can use — and, especially, <em>make</em> — whatever I want. I’m not stuck using just what’s provided to me on some other machines elsewhere: I’m not dialing into a mainframe or doing the modern equivalent of using only websites that other people control.</p>\n\n<p>A world where everything is on the web and nothing is on the machines that we own is a sad world where we’ve lost a core freedom.</p>\n\n<p>I want to preserve that freedom. I like making apps that show the value of that freedom.</p>\n\n<p>What I want to see happen is for Apple to allow iPhone and iPad users to load — not <em>sideload</em>, a term I detest, because it assumes Apple’s side of things — whatever apps they want to. Because those devices are computers.</p>\n\n<p>I get it. It’s not looking good. And even with the much greater freedom for Mac apps there is still always the possibility of being shut down by Apple (by revoking developer memberships, refusing to notarize, or other technical means).</p>\n\n<p>Still, though, I keep at it, because this freedom matters.</p>\n\n<p>But, again…</p>\n\n<p>Apple keeps doing things that make us all feel sick. Removing ICEBlock is just the latest and it won’t be the last. So I am sympathetic to the idea of making web apps, and my brain goes there more often. And if I could solve the problems of money and of protecting users, I’d be way more inclined.</p>\n"
    },
    {
      "title": "Writing Mac and iOS Apps Shouldn’t Be So Difficult",
      "date_published": "2025-08-28T10:26:28-07:00",
      "id": "https://inessential.com/2025/08/28/easy-app-writing.html",
      "url": "https://inessential.com/2025/08/28/easy-app-writing.html",
      "content_html": "<p>\n<p>In the ’90s and early 2000s I worked for UserLand Software — <a href=\"http://scripting.com/\">Dave Winer</a> was founder and CEO — on a Mac app called UserLand Frontier.</p>\n\n<p>The app was a scripting system and hash-table-oriented database that powered the early blogging and podcasting worlds. (That sounds grand, but it’s probably an understatement — but this post isn’t all about Frontier’s impact on the web, so I won’t go into details.)</p>\n\n<p>The app was implemented in two pieces:</p>\n\n<ul>\n  <li>The <em>kernel</em>, written in C, implemented the database, networking, inter-application communication, various built-in data types, script compiler and evaluator and debugger, and so on</li>\n  <li>The <em>scripts</em> used the kernel and implemented most of the actual app behavior</li>\n</ul>\n\n<p>Since it was an app, it had plenty of UI — menus, contextual menus, buttons, larger UI components, and so on. What was brilliant was that you could, for instance, add and edit menus, and when you chose a menu command it would run your script. (Or when you clicked a toolbar button, etc.)</p>\n\n<p>You could write an entire static blog publishing system and the UI to go with it without ever restarting the app. Click a thing, then see what happens in the app — and if it’s not right you’d edit the script, which would be automatically recompiled when called the next time.</p>\n\n<p>In other words, there was absolutely no friction when it came to iteration. Write some code without restarting and see your changes immediately.</p>\n\n<h3 id=\"how-good-was-this-really-in-practice\">How good was this really in practice?</h3>\n\n<p>You might imagine that we could do this for an hour or so before having to make changes to the kernel. Not so.</p>\n\n<p>In fact, for the first three years I was there (might have been longer), I never even <em>saw</em> the kernel code. I worked all day every day as a professional developer at the script level, never having to restart the app. Just iterating like this all day long.</p>\n\n<p>You might also imagine that the app was sluggish and slow since much of it was scripts instead of C code. It wasn’t! Scripts could be slow for the same reasons any code could be slow (I/O, of course, and algorithms and data structures not suited to the problem at hand) — but the app never felt slow.</p>\n\n<p>I’ll remind you of the timing: <em>this was the ’90s.</em> We worked this way for real, and we were amazingly productive.</p>\n\n<p>A scripting language plus key bits implemented in C was more than fast enough for an app. Even all those years ago.</p>\n\n<h3 id=\"a-scripting-language-built-for-productivity\">A scripting language built for productivity</h3>\n\n<p>I’m not writing this article to praise Frontier — I’m talking about it to make a point, which I’ll get to.</p>\n\n<p>But I wanted to bring up a second aspect to this: it’s not just frictionless iteration that was so great, it was also the scripting language and environment.</p>\n\n<p>One of the best parts of this was how easy persistence was. I mentioned the hash-table-based database. Hash tables could contain hash tables (Swift developers: picture a Dictionary inside a Dictionary, and so on).</p>\n\n<p>(We just called them tables for short — but remember that these are hash tables, not tables in a SQL database.)</p>\n\n<p>In any script, at any time, without any ceremony, you could read and write from the database simply using dot notation: <code>user.prefs.city = \"Seattle\"</code> would set the value of <code>city</code> in the <code>prefs</code> table which was contained by the <code>user</code> table. This value would persist between runs of the app, because it was stored in the database.</p>\n\n<p>(You could also pass around addresses of things too — it was quite common to pass the address of a table to another script, so that the other script wouldn’t need to hardcode a location.)</p>\n\n<p>It was utterly automatic. And it meant that while we did have to choose where in the database to store things, and how to structure our storage, we didn’t have to choose a storage mechanism. It was the database.</p>\n\n<p>(Note: of course we could read and write files, and did so when necessary. But the point is that the database handled almost all our persistence and in a super-easy way.)</p>\n\n<p>(Also note: the database had a UI. It was visible and browsable. You could and often did hand-edit it. Even the scripts lived in the database, and were addressable via dot notation, like everything else.)</p>\n\n<h3 id=\"we-had-nice-things\">We had nice things!</h3>\n\n<p>I’ll say again — this was in the ’90s, more than 25 years ago, and it was a great way of working on an app.</p>\n\n<p>I’m not saying apps these days need to be Frontier-like in any details. But it seems absolutely bizarre to me that we — we who write Mac and iOS apps — still have to build and run the app, make changes, build and run the app, and so on, all day long. In the year 2025.</p>\n\n<p>And it seems retro in the worst way that we’re still using anything other than a scripting language for most of our code. We should be using something simple and light that can configure toolbars, handle networking callbacks, query databases, manage views, and so on. And maybe with a DSL for SwiftUI-like declarative UI.</p>\n\n<p>Almost none of that code needs to be in a lower-level language like Swift or Objective-C. It really doesn’t. (I say this as a performance junkie!)</p>\n\n<p>It could be in Ruby, Lua, Python, or JavaScript. Better still would be a new language invented specifically for the problem of writing apps, something designed to make the common challenges of app writing easier.</p>\n\n<p>We did have this stuff decades ago. Not for app making in general, sure — but now it’s 25 years later, and a company like Apple could make this real for all its app makers.</p>\n\n<p>It’s easy to see why things are the way they are right now, and you can point to a string of good decisions. No doubt.</p>\n\n<p>But we can think outside of what we have now and ask: what would make app writing easier? What would make it a better experience? How could we get more done for our users with fewer bugs and faster turnaround?</p>\n\n<p>I’m not saying that Frontier’s specific choices are the answer — I’m saying that the combination of frictionless iteration plus a purpose-built scripting language was extremely powerful, and we could use those things now.</p>\n\n<p>And at some point I suspect these things are going to be table stakes for any platform that wants to attract developers. If you were a new developer right now, would you pick Xcode’s build-and-run, edit, build-and-run, edit — plus the growing complexity of Swift — over something like Electron and JavaScript?</p>\n\n<h3 id=\"random-notes\">Random notes</h3>\n\n<p>Yes, I know about <a href=\"https://en.wikipedia.org/wiki/PyObjC\">PyObjc</a> and <a href=\"https://en.wikipedia.org/wiki/RubyCocoa\">RubyCocoa</a>. Without first-class support in Apple’s developer tools, these were never going to work as popular alternatives.</p>\n\n<p>I also know about (and use) Swift playgrounds and SwiftUI previews. Neither of these are as satisfying to use as I’d like, and neither of these are nearly as great as frictionless iteration in the actual app.</p>\n\n<p>I also remember Xcode fix-and-continue, which didn’t work well enough to solve the problem of frictionless iteration.</p>\n\n<p>Anyway… One more thing about Frontier: we had a system where people could get updates to the app automatically via the web. Those updates were just serialized versions of scripts at various database locations, which would get unpacked and stored in each user’s database. (Those who opted-in, of course.) The app would not have to be restarted to get bug fixes and new features! And of course the updates were very small, since they didn’t include the entire app. This seems so futuristic, but we had this in 1999. Why couldn’t we have this now?</p>\n\n"
    },
    {
      "title": "Tough Season in the Apple Fields",
      "date_published": "2025-08-25T16:59:43-07:00",
      "id": "https://inessential.com/2025/08/25/tough-season.html",
      "url": "https://inessential.com/2025/08/25/tough-season.html",
      "content_html": "<p>\n<p>We’re adopting Liquid Glass for NetNewsWire 7, which we’ll release some time after the new versions of macOS and iOS come out.</p>\n\n<p>Stuart Breckenridge has been doing great work on getting this done — and he’s written up a couple blog posts (with screenshots!) on his progress. See:</p>\n\n<p><a href=\"https://stuartbreckenridge.net/adopting-liquid-glass-part-ii-netnewswire-mac/\">Adopting Liquid Glass, Part II (NetNewsWire Mac)</a><br />\n<a href=\"https://stuartbreckenridge.net/adopting-liquid-glass-part-iii-netnewswire-ios/\">Adopting Liquid Glass, Part III (NetNewsWire iOS)</a></p>\n\n<p>Since the app is made with mostly stock Apple UI, you might think that using Liquid Glass would be very little work, that it might be pretty automatic or just a matter of checking a few boxes. But that’s not true this year: it’s been a fair amount of work.</p>\n\n<p>Other apps, apps with more custom UI, will probably have even more work, but even for us it’s been more than a bit.</p>\n\n<p>And we’re not done. There will be little things (hopefully just little things) still to do before shipping. Including verifying that it all works as expected on the actual OS releases.</p>\n\n<p>But all credit to Stuart, who got right on this and did a superb job.</p>\n\n<p>(Note: if you want to see the code, you can: it’s on our <a href=\"https://github.com/Ranchero-Software/NetNewsWire/tree/experimental/liquid-glass\">experimental/liquid-glass branch</a>.)</p>\n\n<h3 id=\"but-my-mac\">But My Mac</h3>\n\n<p>As pleased as I am with Stuart’s work, I’m not pleased with Liquid Glass itself.</p>\n\n<p>I don’t really care about it on iOS/iPadOS, because whatever. I don’t love those devices. I love Macs because it’s on Macs where you can set out to make new things that change the world.</p>\n\n<p>(Okay. Fine. On iPhones and iPads you <em>can</em>, I guess, but generally it’s much harder, and it has to be an approved activity using an approved app. And one thing you definitely can’t do on those devices is create apps. [All apologies to people who do manage to edit their podcast episodes on an iPad or write at length on an iPhone. Cool! But I hope that even those folks will grant me my point.])</p>\n\n<p>And so I seriously dislike the experience of using a Mac with Liquid Glass. The UI has become the star, but the drunken star, blurry, illegible, and physically unstable. It makes making things way more of a struggle than it used to be.</p>\n\n<p>We had pretty good Mac UI, but Apple took the bad parts of it — the translucency and blurriness already there — and dialed it way up and called it content-centric. But it seems to me the opposite. Liquid Glass is Liquid-Glass-centric.</p>\n\n<h3 id=\"perspective\">Perspective</h3>\n\n<p>First thing: I have many friends at Apple and I didn’t want to write any of this. And there are legions of engineers and designers who I don’t know but whose work I respect greatly. It’s not their fault that this is the direction of the UI.</p>\n\n<p>And this is not the first time we’re going through a rough patch with Apple. I think of them as seasons — we had, for instance, terrible-keyboard season not so long ago. We were wondering if Apple would just stop making Macs altogether. But then that passed and we even got these wonderful Apple Silicon machines. Seasons end.</p>\n\n<p>And we’re in a tough season with Swift these days too. It’s gotten so complex and difficult that I find myself daydreaming about going back to Objective-C. Objective-C is definitely funny-looking, but once you get past that it’s actually small and simple.</p>\n\n<p>But with <a href=\"https://www.donnywals.com/what-is-approachable-concurrency-in-xcode-26/\">Swift approachable concurrency</a> and other changes I can see eventually getting through this season and to a pretty great place, so I’m optimistic.</p>\n\n<p>Seasons do end, in other words, or mostly seem to end (though not the App Store monopoly season, not so far), and I’ve resolved to just wait for Liquid Glass’s replacement. Perhaps along the way it will get refined enough so that people like me can use it without eye strain.</p>\n\n<h3 id=\"better-perspective\">Better Perspective</h3>\n\n<p>But far, far worse than any of the above is Tim Cook’s gold statue presented to the President. And everything that went along with that. I felt utterly sick and I bet you did too. (And it made me seriously wonder if I wanted to continue writing apps for Apple platforms.)</p>\n\n<p>I understand John Gruber’s argument in <a href=\"https://daringfireball.net/2025/08/gold_frankincense_and_silicon\">Gold, Frankincense, and Silicon</a> that maybe Cook’s move was the best possible move in a terribly corrupted system.</p>\n\n<p>But what’s the use of being so rich and so powerful, I would ask Tim Cook, if you, even more than regular people, have to debase yourself before the dictator?</p>\n\n<p>It’s tempting to think that our current government is just a season, like the bad keyboards or like Liquid Glass will eventually prove to be. Wait till the mid-terms or the next presidential election, you might think.</p>\n\n<p>But there’s no reason to think that this authoritarian turn is just a season. Something besides just wishing and waiting for better is required.</p>\n\n"
    },
    {
      "title": "Breakpoints Show Thursday in Seattle",
      "date_published": "2025-08-18T10:54:18-07:00",
      "id": "https://inessential.com/2025/08/18/free-breakpoints-show.html",
      "url": "https://inessential.com/2025/08/18/free-breakpoints-show.html",
      "content_html": "<p>\n<p>James Dempsey and the Breakpoints will be appearing in a <a href=\"https://xcoders.org/2025/08/12/special-event-breakpoint-jam-with.html\">Breakpoints Jam this Thursday</a> (Aug. 21) at Bale Breaker in Ballard. Free show! Awesome songs!</p>\n\n<p>The event starts at 6 pm and music will start around 7 pm. I’ll be on guitar — and you can expect local superstars Ken Case (keyboard, vocals) and Laura Savino (vocals) plus a special mystery guest or two from out of town.</p>\n\n<p>The show will be mostly acoustic, and it will be outside at the picnic tables. I hope to see you there!</p>\n"
    }
  ]
}
